In [1]:
import pandas as pd 
import numpy as np 
import os 
print(os.getcwd())

c:\Users\FURKANN\Desktop\PythonForDataScience

In [2]:
data= pd.Series([1, 3, 5, np.nan, 6, 8])
data

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
pd.Series([1, 3, 5, np.nan, 6, 8],index=list("abcdef"))

a    1.0
b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
dtype: float64

In [4]:
dates=pd.date_range(start="01-01-2000",end="13-01-2000",periods=6)
dates

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-03 09:36:00',
               '2000-01-05 19:12:00', '2000-01-08 04:48:00',
               '2000-01-10 14:24:00', '2000-01-13 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [5]:
date_data=pd.DataFrame(np.random.randint(10,50,16).reshape(4,4),index=pd.date_range(start="01-01-2025",end="13-01-2025",periods=4),columns=list("ABCD"))
date_data

             A   B   C   D
2025-01-01  45  14  32  19
2025-01-05  46  16  14  34
2025-01-09  19  38  31  25
2025-01-13  39  42  33  12

In [6]:
date_data["C"]

2025-01-01    32
2025-01-05    14
2025-01-09    31
2025-01-13    33
Name: C, dtype: int32

In [7]:
date_data[["A","B"]]

             A   B
2025-01-01  45  14
2025-01-05  46  16
2025-01-09  19  38
2025-01-13  39  42

In [8]:
date_data.loc["2025-01-01"]

A    45
B    14
C    32
D    19
Name: 2025-01-01 00:00:00, dtype: int32

In [9]:
date_data.iloc[0]

A    45
B    14
C    32
D    19
Name: 2025-01-01 00:00:00, dtype: int32

In [10]:
date_data.iloc[0:3]

             A   B   C   D
2025-01-01  45  14  32  19
2025-01-05  46  16  14  34
2025-01-09  19  38  31  25

In [11]:
date_data.iloc[0:3,0:2]       #[satır:satır,sütun:sütun]

             A   B
2025-01-01  45  14
2025-01-05  46  16
2025-01-09  19  38

In [12]:
date_data["new_column"]=11
date_data

             A   B   C   D  new_column
2025-01-01  45  14  32  19          11
2025-01-05  46  16  14  34          11
2025-01-09  19  38  31  25          11
2025-01-13  39  42  33  12          11

In [13]:
date_data.drop("new_column",axis=1)   #inplace true yapmazsak date_data da hala new_column var olmaya devam eder

             A   B   C   D
2025-01-01  45  14  32  19
2025-01-05  46  16  14  34
2025-01-09  19  38  31  25
2025-01-13  39  42  33  12

In [14]:
date_data.drop("2025-01-01",axis=0,inplace=True) #2. kez calistirirsak hata aliriz cünkü verilen satir yok

In [15]:
date_data

             A   B   C   D  new_column
2025-01-05  46  16  14  34          11
2025-01-09  19  38  31  25          11
2025-01-13  39  42  33  12          11

In [16]:
new_row=pd.DataFrame([[25, 35, 45, 20,11]],columns=["A", "B", "C", "D","new_column"],index=["2025-01-01"])
date_data=pd.concat([date_data, new_row])
date_data

                      A   B   C   D  new_column
2025-01-05 00:00:00  46  16  14  34          11
2025-01-09 00:00:00  19  38  31  25          11
2025-01-13 00:00:00  39  42  33  12          11
2025-01-01           25  35  45  20          11

In [17]:
date_data[date_data["B"]>13]

                      A   B   C   D  new_column
2025-01-05 00:00:00  46  16  14  34          11
2025-01-09 00:00:00  19  38  31  25          11
2025-01-13 00:00:00  39  42  33  12          11
2025-01-01           25  35  45  20          11

In [18]:
date_data.reset_index()

                 index   A   B   C   D  new_column
0  2025-01-05 00:00:00  46  16  14  34          11
1  2025-01-09 00:00:00  19  38  31  25          11
2  2025-01-13 00:00:00  39  42  33  12          11
3           2025-01-01  25  35  45  20          11

In [19]:
date_data

                      A   B   C   D  new_column
2025-01-05 00:00:00  46  16  14  34          11
2025-01-09 00:00:00  19  38  31  25          11
2025-01-13 00:00:00  39  42  33  12          11
2025-01-01           25  35  45  20          11

In [20]:
datas=np.random.random(24).reshape(6,4)
new_df=pd.DataFrame(data=datas,index=["Furkan","Can","Sevim","Umay","Gökçe","Almila"],columns=["Salary","performance","prim","mesai"])
new_df

          Salary  performance      prim     mesai
Furkan  0.855501     0.446058  0.152762  0.465685
Can     0.285688     0.571406  0.232133  0.217515
Sevim   0.949047     0.045632  0.359258  0.400436
Umay    0.984401     0.120193  0.956285  0.774677
Gökçe   0.014010     0.735580  0.506893  0.593127
Almila  0.813207     0.358008  0.523428  0.795584

In [21]:
gruplar=["Yönetim","Yönetim","Yönetim","Calisan","Calisan","Calisan"]
new_df.index=pd.MultiIndex.from_arrays([gruplar,new_df.index],names=["görev","isim"])
new_df

                  Salary  performance      prim     mesai
görev   isim
Yönetim Furkan  0.855501     0.446058  0.152762  0.465685
        Can     0.285688     0.571406  0.232133  0.217515
        Sevim   0.949047     0.045632  0.359258  0.400436
Calisan Umay    0.984401     0.120193  0.956285  0.774677
        Gökçe   0.014010     0.735580  0.506893  0.593127
        Almila  0.813207     0.358008  0.523428  0.795584

In [22]:
new_df.index = new_df.index.droplevel("görev")
new_df

          Salary  performance      prim     mesai
isim
Furkan  0.855501     0.446058  0.152762  0.465685
Can     0.285688     0.571406  0.232133  0.217515
Sevim   0.949047     0.045632  0.359258  0.400436
Umay    0.984401     0.120193  0.956285  0.774677
Gökçe   0.014010     0.735580  0.506893  0.593127
Almila  0.813207     0.358008  0.523428  0.795584

In [23]:
outer_index=["Yönetim","Yönetim","Yönetim","Calisan","Calisan","Calisan"]
first_index=["Furkan","Can","Sevim","Umay","Gökçe","Almila"]
zipped_index=list(zip(outer_index,first_index))
zipped_index=pd.MultiIndex.from_tuples(zipped_index)
new_df=pd.DataFrame(data=datas,index=zipped_index,columns=["Salary","performance","prim","mesai"])
new_df

                  Salary  performance      prim     mesai
Yönetim Furkan  0.855501     0.446058  0.152762  0.465685
        Can     0.285688     0.571406  0.232133  0.217515
        Sevim   0.949047     0.045632  0.359258  0.400436
Calisan Umay    0.984401     0.120193  0.956285  0.774677
        Gökçe   0.014010     0.735580  0.506893  0.593127
        Almila  0.813207     0.358008  0.523428  0.795584

In [24]:
new_df.loc["Yönetim"]   #df[yönetim] calısmıyor cünkü MultiIndex kullanıldığında "Yönetim" bir sütun değil, bir index seviyesinin değeridir.
                        #df[yönetim] sütun arar

          Salary  performance      prim     mesai
Furkan  0.855501     0.446058  0.152762  0.465685
Can     0.285688     0.571406  0.232133  0.217515
Sevim   0.949047     0.045632  0.359258  0.400436

In [25]:
new_df.loc["Yönetim"]["prim"]

Furkan    0.152762
Can       0.232133
Sevim     0.359258
Name: prim, dtype: float64

In [26]:
new_df.loc[("Yönetim","Furkan")]

Salary         0.855501
performance    0.446058
prim           0.152762
mesai          0.465685
Name: (Yönetim, Furkan), dtype: float64

In [27]:
employee=pd.read_csv("6-employee.csv")
employee.head(5)

  Department Employee  Salary  Experience           City
0  Marketing    Emp_1   53483           1       New York
1      Sales    Emp_2   78555           8         Austin
2    Finance    Emp_3   47159           3         Austin
3      Sales    Emp_4  110077           3  San Francisco
4      Sales    Emp_5   65920           1       New York

In [28]:
employee.tail(5)

   Department Employee  Salary  Experience           City
45         HR   Emp_46   97563          13  San Francisco
46         IT   Emp_47   32695           3       New York
47      Sales   Emp_48   78190           7         Austin
48         IT   Emp_49   35258           1       New York
49  Marketing   Emp_50  117538           4       New York

In [29]:
employee.describe()

              Salary  Experience
count      50.000000   50.000000
mean    78344.500000    7.060000
std     27817.603904    3.966235
min     31016.000000    1.000000
25%     53687.250000    3.000000
50%     78769.500000    7.000000
75%    100778.000000   10.000000
max    119812.000000   14.000000

In [30]:
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Department  50 non-null     object
 1   Employee    50 non-null     object
 2   Salary      50 non-null     int64
 3   Experience  50 non-null     int64
 4   City        50 non-null     object
dtypes: int64(2), object(3)
memory usage: 2.1+ KB

In [31]:
employee.isna().head()

   Department  Employee  Salary  Experience   City
0       False     False   False       False  False
1       False     False   False       False  False
2       False     False   False       False  False
3       False     False   False       False  False
4       False     False   False       False  False

In [32]:
employee.dropna().head()

  Department Employee  Salary  Experience           City
0  Marketing    Emp_1   53483           1       New York
1      Sales    Emp_2   78555           8         Austin
2    Finance    Emp_3   47159           3         Austin
3      Sales    Emp_4  110077           3  San Francisco
4      Sales    Emp_5   65920           1       New York

In [33]:
weather=pd.read_excel("6-weather.xlsx", engine="openpyxl")

In [34]:
weather.isna()

   Istanbul  New York  Amsterdam  Paris
0     False     False      False  False
1     False     False      False  False
2     False     False      False  False
3     False     False      False  False
4     False     False      False  False
5     False     False      False  False
6     False     False      False  False
7     False     False      False  False
8     False     False      False  False

In [35]:
weather.dropna()

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20
5        28        13         22     16
6        15        12         15     15
7        20        15         14     14
8        22        16         16     16

In [36]:
weather.fillna(20)

   Istanbul  New York  Amsterdam  Paris
0        20        10         15     12
1        21        10         17     14
2        20        13         18     15
3        22        14         19     18
4        25        15         15     20
5        28        13         22     16
6        15        12         15     15
7        20        15         14     14
8        22        16         16     16

In [37]:
weather.count()

Istanbul     9
New York     9
Amsterdam    9
Paris        9
dtype: int64

In [38]:
grouped=employee.groupby("Department")
grouped.count()

            Employee  Salary  Experience  City
Department
Finance           10      10          10    10
HR                 7       7           7     7
IT                10      10          10    10
Marketing         13      13          13    13
Sales             10      10          10    10

In [39]:
grouped["Salary"].mean()

Department
Finance      90552.700000
HR           76182.571429
IT           63381.600000
Marketing    79555.000000
Sales        81038.900000
Name: Salary, dtype: float64

In [40]:
df1=pd.read_csv("7-concat_data1.csv")
df2=pd.read_csv("7-concat_data2.csv")

In [41]:
df2.head(5)

   Employee_ID    Name Department
0           11  Emp_11    Finance
1           12  Emp_12    Finance
2           13  Emp_13    Finance
3           14  Emp_14    Finance
4           15  Emp_15  Marketing

In [42]:
df1.head(5)

   Employee_ID   Name Department
0            1  Emp_1    Finance
1            2  Emp_2  Marketing
2            3  Emp_3         HR
3            4  Emp_4    Finance
4            5  Emp_5    Finance

In [44]:
concat_df=pd.concat([df1,df2],ignore_index=True)
concat_df

    Employee_ID    Name Department
0             1   Emp_1    Finance
1             2   Emp_2  Marketing
2             3   Emp_3         HR
3             4   Emp_4    Finance
4             5   Emp_5    Finance
5             6   Emp_6  Marketing
6             7   Emp_7         HR
7             8   Emp_8         HR
8             9   Emp_9    Finance
9            10  Emp_10         IT
10           11  Emp_11    Finance
11           12  Emp_12    Finance
12           13  Emp_13    Finance
13           14  Emp_14    Finance
14           15  Emp_15  Marketing
15           16  Emp_16         HR
16           17  Emp_17  Marketing
17           18  Emp_18  Marketing
18           19  Emp_19  Marketing
19           20  Emp_20    Finance